app/controllers/url_shorts_controller.rb

SELECT  "url_shorts".* FROM "url_shorts" WHERE (lower(code) ='abcd')  ORDER BY "url_shorts"."id" ASC LIMIT 1
---
  def forward_to_phs
    @url_short = UrlShort.where('lower(code) =?', params[:code].downcase).first

SELECT "url_shorts".* FROM "url_shorts"
---
  def index
    @url_shorts = UrlShort.all

INSERT INTO "url_shorts" ("code", "end_point", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", "1234"], ["end_point", "http://localhost:3005"], ["created_at", "2015-01-23 07:49:14.648038"], ["updated_at", "2015-01-23 07:49:14.648038"]]
---
  def create
    @url_short = UrlShort.new(url_short_params)
    @url_short.save

SELECT  "url_shorts".* FROM "url_shorts" WHERE "url_shorts"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_url_short
      @url_short = UrlShort.find(params[:id])